Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/edc/ATSAMV71N20B.PIC
      <edc:SFRDef edc:_addr="0x4003001C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-nnnnnnn" edc:cname="MCAN0_NBTP" edc:impl="0xFFFFFF7F" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="NTSEG2" edc:desc="Nominal Time Segment After Sample Point" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NTSEG1" edc:desc="Nominal Time Segment Before Sample Point" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="NBRP" edc:desc="Nominal Bit Rate Prescaler" edc:nzwidth="0x9"/>
            <edc:SFRFieldDef edc:cname="NSJW" edc:desc="Nominal (Re) Synchronization Jump Width" edc:nzwidth="0x7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40030020" edc:access="------------nnnn--------------nn" edc:cname="MCAN0_TSCC" edc:impl="0xF0003" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="TSS" edc:desc="Timestamp Select" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="ALWAYS_0" edc:desc="Timestamp counter value always 0x0000" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TCP_INC" edc:desc="Timestamp counter value incremented according to TCP" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="EXT_TIMESTAMP" edc:desc="External timestamp counter value used" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0xE"/>
            <edc:SFRFieldDef edc:cname="TCP" edc:desc="Timestamp Counter Prescaler" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40030024" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="MCAN0_TSCV" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="TSC" edc:desc="Timestamp Counter (cleared on write)" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40030028" edc:access="nnnnnnnnnnnnnnnn-------------nnn" edc:cname="MCAN0_TOCC" edc:impl="0xFFFF0007" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="ETOC" edc:desc="Enable Timeout Counter" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO_TIMEOUT" edc:desc="Timeout Counter disabled." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="TOS_CONTROLLED" edc:desc="Timeout Counter enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TOS" edc:desc="Timeout Select" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="CONTINUOUS" edc:desc="Continuous operation" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TX_EV_TIMEOUT" edc:desc="Timeout controlled by Tx Event FIFO" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="RX0_EV_TIMEOUT" edc:desc="Timeout controlled by Receive FIFO 0" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="RX1_EV_TIMEOUT" edc:desc="Timeout controlled by Receive FIFO 1" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="TOP" edc:desc="Timeout Period" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003002C" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="MCAN0_TOCV" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="TOC" edc:desc="Timeout Counter (cleared on write)" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40030030" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x40030040" edc:access="--------rrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="MCAN0_ECR" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="TEC" edc:desc="Transmit Error Counter" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="REC" edc:desc="Receive Error Counter" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="RP" edc:desc="Receive Error Passive" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CEL" edc:desc="CAN Error Logging (cleared on read)" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40030044" edc:access="---------rrrrrrr-rrrrrrrrrrrrrrr" edc:cname="MCAN0_PSR" edc:impl="0x7F7FFF" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="LEC" edc:desc="Last Error Code (set to 111 on read)" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NO_ERROR" edc:desc="No error occurred since LEC has been reset by successful reception or transmission." edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="STUFF_ERROR" edc:desc="More than 5 equal bits in a sequence have occurred in a part of a received message where this is not allowed." edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FORM_ERROR" edc:desc="A fixed format part of a received frame has the wrong format." edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="ACK_ERROR" edc:desc="The message transmitted by the MCAN was not acknowledged by another node." edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="BIT1_ERROR" edc:desc="During transmission of a message (with the exception of the arbitration field), the device tried to send a recessive level (bit of logical value '1'), but the monitored bus value was dominant." edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="BIT0_ERROR" edc:desc="During transmission of a message (or acknowledge bit, or active error flag, or overload flag), the device tried to send a dominant level (data or identifier bit logical value '0'), but the monitored bus value was recessive. During Bus_Off recovery, this status is set each time a sequence of 11 recessive bits has been monitored. This enables the processor to monitor the proceeding of the Bus_Off recovery sequence (indicating the bus is not stuck at dominant or continuously disturbed)." edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="CRC_ERROR" edc:desc="The CRC check sum of a received message was incorrect. The CRC of an incoming message does not match the CRC calculated from the received data." edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="NO_CHANGE" edc:desc="Any read access to the Protocol Status Register re-initializes the LEC to '7'. When the LEC shows value '7', no CAN bus event was detected since the last processor read access to the Protocol Status Register." edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ACT" edc:desc="Activity" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="SYNCHRONIZING" edc:desc="Node is synchronizing on CAN communication" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="IDLE" edc:desc="Node is neither receiver nor transmitter" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="RECEIVER" edc:desc="Node is operating as receiver" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TRANSMITTER" edc:desc="Node is operating as transmitter" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EP" edc:desc="Error Passive" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EW" edc:desc="Warning Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BO" edc:desc="Bus_Off Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DLEC" edc:desc="Data Phase Last Error Code (set to 111 on read)" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="RESI" edc:desc="ESI Flag of Last Received CAN FD Message (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RBRS" edc:desc="BRS Flag of Last Received CAN FD Message (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RFDF" edc:desc="Received a CAN FD Message (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PXE" edc:desc="Protocol Exception Event (cleared on read)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TDCV" edc:desc="Transmitter Delay Compensation Value" edc:nzwidth="0x7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40030048" edc:access="-----------------nnnnnnn-nnnnnnn" edc:cname="MCAN0_TDCR" edc:impl="0x7F7F" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="TDCF" edc:desc="Transmitter Delay Compensation Filter" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TDCO" edc:desc="Transmitter Delay Compensation Offset" edc:nzwidth="0x7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4003004C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x40030050" edc:access="--nnnnnnnn--nnnnnnnnnnnnnnnnnnnn" edc:cname="MCAN0_IR" edc:impl="0x3FCFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="RF0N" edc:desc="Receive FIFO 0 New Message" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF0W" edc:desc="Receive FIFO 0 Watermark Reached" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF0F" edc:desc="Receive FIFO 0 Full" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF0L" edc:desc="Receive FIFO 0 Message Lost" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1N" edc:desc="Receive FIFO 1 New Message" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1W" edc:desc="Receive FIFO 1 Watermark Reached" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1F" edc:desc="Receive FIFO 1 Full" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1L" edc:desc="Receive FIFO 1 Message Lost" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HPM" edc:desc="High Priority Message" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC" edc:desc="Transmission Completed" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCF" edc:desc="Transmission Cancellation Finished" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFE" edc:desc="Tx FIFO Empty" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFN" edc:desc="Tx Event FIFO New Entry" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFW" edc:desc="Tx Event FIFO Watermark Reached" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFF" edc:desc="Tx Event FIFO Full" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFL" edc:desc="Tx Event FIFO Element Lost" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TSW" edc:desc="Timestamp Wraparound" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MRAF" edc:desc="Message RAM Access Failure" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TOO" edc:desc="Timeout Occurred" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DRX" edc:desc="Message stored to Dedicated Receive Buffer" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ELO" edc:desc="Error Logging Overflow" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EP" edc:desc="Error Passive" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EW" edc:desc="Warning Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BO" edc:desc="Bus_Off Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDI" edc:desc="Watchdog Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEA" edc:desc="Protocol Error in Arbitration Phase" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PED" edc:desc="Protocol Error in Data Phase" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARA" edc:desc="Access to Reserved Address" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40030054" edc:access="--nnnnnnnn--nnnnnnnnnnnnnnnnnnnn" edc:cname="MCAN0_IE" edc:impl="0x3FCFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="RF0NE" edc:desc="Receive FIFO 0 New Message Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF0WE" edc:desc="Receive FIFO 0 Watermark Reached Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF0FE" edc:desc="Receive FIFO 0 Full Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF0LE" edc:desc="Receive FIFO 0 Message Lost Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1NE" edc:desc="Receive FIFO 1 New Message Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1WE" edc:desc="Receive FIFO 1 Watermark Reached Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1FE" edc:desc="Receive FIFO 1 Full Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1LE" edc:desc="Receive FIFO 1 Message Lost Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HPME" edc:desc="High Priority Message Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCE" edc:desc="Transmission Completed Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCFE" edc:desc="Transmission Cancellation Finished Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFEE" edc:desc="Tx FIFO Empty Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFNE" edc:desc="Tx Event FIFO New Entry Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFWE" edc:desc="Tx Event FIFO Watermark Reached Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFFE" edc:desc="Tx Event FIFO Full Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFLE" edc:desc="Tx Event FIFO Event Lost Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TSWE" edc:desc="Timestamp Wraparound Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MRAFE" edc:desc="Message RAM Access Failure Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TOOE" edc:desc="Timeout Occurred Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DRXE" edc:desc="Message stored to Dedicated Receive Buffer Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ELOE" edc:desc="Error Logging Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPE" edc:desc="Error Passive Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EWE" edc:desc="Warning Status Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BOE" edc:desc="Bus_Off Status Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDIE" edc:desc="Watchdog Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEAE" edc:desc="Protocol Error in Arbitration Phase Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEDE" edc:desc="Protocol Error in Data Phase Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARAE" edc:desc="Access to Reserved Address Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40030058" edc:access="--nnnnnnnn--nnnnnnnnnnnnnnnnnnnn" edc:cname="MCAN0_ILS" edc:impl="0x3FCFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="RF0NL" edc:desc="Receive FIFO 0 New Message Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF0WL" edc:desc="Receive FIFO 0 Watermark Reached Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF0FL" edc:desc="Receive FIFO 0 Full Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF0LL" edc:desc="Receive FIFO 0 Message Lost Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1NL" edc:desc="Receive FIFO 1 New Message Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1WL" edc:desc="Receive FIFO 1 Watermark Reached Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1FL" edc:desc="Receive FIFO 1 Full Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1LL" edc:desc="Receive FIFO 1 Message Lost Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HPML" edc:desc="High Priority Message Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCL" edc:desc="Transmission Completed Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCFL" edc:desc="Transmission Cancellation Finished Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFEL" edc:desc="Tx FIFO Empty Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFNL" edc:desc="Tx Event FIFO New Entry Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFWL" edc:desc="Tx Event FIFO Watermark Reached Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFFL" edc:desc="Tx Event FIFO Full Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFLL" edc:desc="Tx Event FIFO Event Lost Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TSWL" edc:desc="Timestamp Wraparound Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MRAFL" edc:desc="Message RAM Access Failure Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TOOL" edc:desc="Timeout Occurred Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DRXL" edc:desc="Message stored to Dedicated Receive Buffer Interrupt Line" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ELOL" edc:desc="Error Logging Overflow Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPL" edc:desc="Error Passive Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EWL" edc:desc="Warning Status Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BOL" edc:desc="Bus_Off Status Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDIL" edc:desc="Watchdog Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEAL" edc:desc="Protocol Error in Arbitration Phase Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEDL" edc:desc="Protocol Error in Data Phase Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARAL" edc:desc="Access to Reserved Address Line" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
