Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/edc/ATSAMV71N20B.PIC
      <edc:SFRDef edc:_addr="0x4003819C" edc:access="-------------------w----wwwwwwww" edc:cname="USBHS_DEVEPTIFR3" edc:impl="0x10FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINIS" edc:desc="Transmitted IN Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTIS" edc:desc="Received OUT Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFIS" edc:desc="Underflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRIS" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHIS" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:desc="Overflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRIS" edc:desc="CRC Error Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETS" edc:desc="Short Packet Interrupt Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:desc="Number of Busy Banks Interrupt Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400381A0" edc:access="-------------------w----wwwwwwww" edc:cname="USBHS_DEVEPTIFR4" edc:impl="0x10FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINIS" edc:desc="Transmitted IN Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTIS" edc:desc="Received OUT Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFIS" edc:desc="Underflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRIS" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHIS" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:desc="Overflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRIS" edc:desc="CRC Error Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETS" edc:desc="Short Packet Interrupt Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:desc="Number of Busy Banks Interrupt Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400381A4" edc:access="-------------------w----wwwwwwww" edc:cname="USBHS_DEVEPTIFR5" edc:impl="0x10FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINIS" edc:desc="Transmitted IN Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTIS" edc:desc="Received OUT Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFIS" edc:desc="Underflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRIS" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHIS" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:desc="Overflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRIS" edc:desc="CRC Error Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETS" edc:desc="Short Packet Interrupt Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:desc="Number of Busy Banks Interrupt Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400381A8" edc:access="-------------------w----wwwwwwww" edc:cname="USBHS_DEVEPTIFR6" edc:impl="0x10FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINIS" edc:desc="Transmitted IN Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTIS" edc:desc="Received OUT Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFIS" edc:desc="Underflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRIS" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHIS" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:desc="Overflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRIS" edc:desc="CRC Error Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETS" edc:desc="Short Packet Interrupt Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:desc="Number of Busy Banks Interrupt Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400381AC" edc:access="-------------------w----wwwwwwww" edc:cname="USBHS_DEVEPTIFR7" edc:impl="0x10FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINIS" edc:desc="Transmitted IN Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTIS" edc:desc="Received OUT Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFIS" edc:desc="Underflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRIS" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHIS" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:desc="Overflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRIS" edc:desc="CRC Error Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETS" edc:desc="Short Packet Interrupt Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:desc="Number of Busy Banks Interrupt Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400381B0" edc:access="-------------------w----wwwwwwww" edc:cname="USBHS_DEVEPTIFR8" edc:impl="0x10FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINIS" edc:desc="Transmitted IN Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTIS" edc:desc="Received OUT Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFIS" edc:desc="Underflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRIS" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHIS" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:desc="Overflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRIS" edc:desc="CRC Error Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETS" edc:desc="Short Packet Interrupt Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:desc="Number of Busy Banks Interrupt Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400381B4" edc:access="-------------------w----wwwwwwww" edc:cname="USBHS_DEVEPTIFR9" edc:impl="0x10FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINIS" edc:desc="Transmitted IN Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTIS" edc:desc="Received OUT Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFIS" edc:desc="Underflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRIS" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHIS" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:desc="Overflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRIS" edc:desc="CRC Error Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETS" edc:desc="Short Packet Interrupt Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:desc="Number of Busy Banks Interrupt Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400381B8" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x400381C0" edc:access="------------rrrr-rrr-rrrrrrrrrrr" edc:cname="USBHS_DEVEPTIMR0" edc:impl="0xF77FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINE" edc:desc="Transmitted IN Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTE" edc:desc="Received OUT Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFE" edc:desc="Underflow Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRE" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHE" edc:desc="High Bandwidth Isochronous IN Flush Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFE" edc:desc="Overflow Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRE" edc:desc="CRC Error Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETE" edc:desc="Short Packet Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MDATAE" edc:desc="MData Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAXE" edc:desc="DataX Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSE" edc:desc="Transaction Error Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKE" edc:desc="Number of Busy Banks Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KILLBK" edc:desc="Kill IN Bank" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCON" edc:desc="FIFO Control" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMA" edc:desc="Endpoint Interrupts Disable HDMA Request" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDIS" edc:desc="NYET Token Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDT" edc:desc="Reset Data Toggle" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ" edc:desc="STALL Request" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400381C4" edc:access="------------rrrr-rrr-rrrrrrrrrrr" edc:cname="USBHS_DEVEPTIMR1" edc:impl="0xF77FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINE" edc:desc="Transmitted IN Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTE" edc:desc="Received OUT Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFE" edc:desc="Underflow Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRE" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHE" edc:desc="High Bandwidth Isochronous IN Flush Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFE" edc:desc="Overflow Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRE" edc:desc="CRC Error Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETE" edc:desc="Short Packet Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MDATAE" edc:desc="MData Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAXE" edc:desc="DataX Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSE" edc:desc="Transaction Error Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKE" edc:desc="Number of Busy Banks Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KILLBK" edc:desc="Kill IN Bank" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCON" edc:desc="FIFO Control" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMA" edc:desc="Endpoint Interrupts Disable HDMA Request" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDIS" edc:desc="NYET Token Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDT" edc:desc="Reset Data Toggle" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ" edc:desc="STALL Request" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400381C8" edc:access="------------rrrr-rrr-rrrrrrrrrrr" edc:cname="USBHS_DEVEPTIMR2" edc:impl="0xF77FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINE" edc:desc="Transmitted IN Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTE" edc:desc="Received OUT Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFE" edc:desc="Underflow Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRE" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHE" edc:desc="High Bandwidth Isochronous IN Flush Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFE" edc:desc="Overflow Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRE" edc:desc="CRC Error Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETE" edc:desc="Short Packet Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MDATAE" edc:desc="MData Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAXE" edc:desc="DataX Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSE" edc:desc="Transaction Error Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKE" edc:desc="Number of Busy Banks Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KILLBK" edc:desc="Kill IN Bank" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCON" edc:desc="FIFO Control" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMA" edc:desc="Endpoint Interrupts Disable HDMA Request" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDIS" edc:desc="NYET Token Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDT" edc:desc="Reset Data Toggle" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ" edc:desc="STALL Request" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400381CC" edc:access="------------rrrr-rrr-rrrrrrrrrrr" edc:cname="USBHS_DEVEPTIMR3" edc:impl="0xF77FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINE" edc:desc="Transmitted IN Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTE" edc:desc="Received OUT Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFE" edc:desc="Underflow Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRE" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHE" edc:desc="High Bandwidth Isochronous IN Flush Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFE" edc:desc="Overflow Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRE" edc:desc="CRC Error Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETE" edc:desc="Short Packet Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MDATAE" edc:desc="MData Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAXE" edc:desc="DataX Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSE" edc:desc="Transaction Error Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKE" edc:desc="Number of Busy Banks Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KILLBK" edc:desc="Kill IN Bank" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCON" edc:desc="FIFO Control" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMA" edc:desc="Endpoint Interrupts Disable HDMA Request" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDIS" edc:desc="NYET Token Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDT" edc:desc="Reset Data Toggle" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ" edc:desc="STALL Request" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400381D0" edc:access="------------rrrr-rrr-rrrrrrrrrrr" edc:cname="USBHS_DEVEPTIMR4" edc:impl="0xF77FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINE" edc:desc="Transmitted IN Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTE" edc:desc="Received OUT Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFE" edc:desc="Underflow Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRE" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHE" edc:desc="High Bandwidth Isochronous IN Flush Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFE" edc:desc="Overflow Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRE" edc:desc="CRC Error Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETE" edc:desc="Short Packet Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MDATAE" edc:desc="MData Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAXE" edc:desc="DataX Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSE" edc:desc="Transaction Error Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKE" edc:desc="Number of Busy Banks Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KILLBK" edc:desc="Kill IN Bank" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCON" edc:desc="FIFO Control" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMA" edc:desc="Endpoint Interrupts Disable HDMA Request" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDIS" edc:desc="NYET Token Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDT" edc:desc="Reset Data Toggle" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ" edc:desc="STALL Request" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
